Процедура ЗаполнитьАвтоматически() Экспорт

	Выплата.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВМК_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(ВМК_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВМК_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВМК_ВзаиморасчетыССотрудникамиОстатки
	|ГДЕ
	|	ВМК_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВМК_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	Запрос.УстановитьПараметр("Дата", Дата );
	
	Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Выплата.Добавить();
        НоваяСтрока.Сотрудник = Выборка.Сотрудник;
        НоваяСтрока.Сумма = Выборка.СуммаОстаток;
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВМК_ВзаиморасчетыССотрудниками
	Движения.ВМК_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплата из Выплата Цикл
		Движение = Движения.ВМК_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ТекСтрокаВыплата.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплата.Сумма;
	КонецЦикла;
	Движения.ВМК_ВзаиморасчетыССотрудниками.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
    