
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка из ГрафикОтпусков Цикл
		
		КоличествоДней = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала))/ (60 * 60 * 24);
		
		МенеджерЗаписи = РегистрыСведений.ВМК_Отпуска.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Год;
		МенеджерЗаписи.Сотрудник = Строка.Сотрудник;
		МенеджерЗаписи.ВидОтпуска = Перечисления.ВМК_ВидОтпуска.План;
		МенеджерЗаписи.КоличествоДней = КоличествоДней;
		МенеджерЗаписи.ДатаНачала = Строка.ДатаНачала;
		МенеджерЗаписи.ДатаОкончания = Строка.ДатаОкончания;
		МенеджерЗаписи.Записать();
			
	КонецЦикла;
	
КонецПроцедуры
