&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СоздатьЭлементыАбонентскогоДоговора();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		ВидимостьДоговораПоТипу();		
	
КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидДоговораПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	ВидимостьДоговораПоТипу();

КонецПроцедуры

&НаСервере
Процедура ВидимостьДоговораПоТипу() 
	ЭтоАбонентскийДоговор = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	
		Элементы.ПолеДатаНач.Видимость = ЭтоАбонентскийДоговор;
		Элементы.ПолеДатаОкон.Видимость = ЭтоАбонентскийДоговор;
		Элементы.ПолеСуммаАбон.Видимость = ЭтоАбонентскийДоговор;
		Элементы.ПолеСуммаЧаса.Видимость = ЭтоАбонентскийДоговор;

КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыАбонентскогоДоговора()
	
	ГруппаАбонДог = Элементы.Добавить("ГруппаАбонДог", Тип("ГруппаФормы"));
	ГруппаАбонДог.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонДог.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаАбонДог.ОтображатьЗаголовок = Истина;
	ГруппаАбонДог.Заголовок = "Реквизиты абонентского договора";	
	ГруппаАбонДог.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеДатаНач = Элементы.Добавить("ПолеДатаНач", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеДатаНач.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДатаНач.ПутьКДанным = "Объект.ВМК_ДатаНачалаДоговора";
	
	ПолеДатаОкон = Элементы.Добавить("ПолеДатаОкон", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеДатаОкон.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДатаОкон.ПутьКДанным = "Объект.ВМК_ДатаОкончанияДоговора";
	
	ПолеСуммаАбон = Элементы.Добавить("ПолеСуммаАбон", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеСуммаАбон.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаАбон.ПутьКДанным = "Объект.ВМК_СуммаАбонентскойПлаты";
	
	ПолеСуммаЧаса = Элементы.Добавить("ПолеСуммаЧаса", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеСуммаЧаса.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаЧаса.ПутьКДанным = "Объект.ВМК_СуммаЧасаРаботы";
	
КонецПроцедуры

