#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВМК_УведомленияТГ.Текст_Сообщения,
		|	ВМК_УведомленияТГ.Ссылка,
		|	ВМК_ИдентификаторТГ.Значение КАК IDTG,
		|	ВМК_ТокенТГ.Значение КАК TokenTG
		|ИЗ
		|	Справочник.ВМК_УведомленияТГ КАК ВМК_УведомленияТГ,
		|	Константа.ВМК_ТокенТГ КАК ВМК_ТокенТГ,
		|	Константа.ВМК_ИдентификаторТГ КАК ВМК_ИдентификаторТГ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		TokenTG = ВыборкаДетальныеЗаписи.TokenTG;
		IDTG = ВыборкаДетальныеЗаписи.IDTG;
		ТекстСообщения = ВыборкаДетальныеЗаписи.Текст_Сообщения;
		АдресТГ = "api.telegram.org";
		
		Попытка
		Соединение = Новый HTTPСоединение(АдресТГ, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Данные = Новый Структура;
		Данные.Вставить("text", ТекстСообщения);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		АдресЗапроса = "bot" +TokenTG+ "/sendMessage?chat_id="+Формат(IDTG, "ЧГ=");
		HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		HTTPЗапрос .УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		
		Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Если Результат.КодСостояния = 200 Тогда
				СообщениеОтправленоУспешно = Истина;
			Иначе
				ТекстОшибки = СтрШаблон("Ошибка отправки сообщения в Telegram. Код ответа: %1, Текст ответа: %2", 
					Результат.КодСостояния, Результат.ПолучитьТелоКакСтроку());
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка сообщения в Telegram'"), 
					УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			КонецЕсли;
			
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка сообщения в Telegram'"), 
				УровеньЖурналаРегистрации.Ошибка,,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));			
		КонецПопытки;
		
		Если СообщениеОтправленоУспешно Тогда
			Попытка
				Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Объект.Удалить();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление отправленного сообщения'"), 
					УровеньЖурналаРегистрации.Ошибка,,,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
