#Область СлужебныеПРоцедурыИФункции
Функция ЕстьВДоговорВМассиве(Массив, Договор)
    Для Каждого Элемент Из Массив Цикл
        Если Элемент = Договор Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;
    Возврат Ложь;
КонецФункции

Функция СоздатьРеализации(Параметры) Экспорт

    Если НЕ ТипЗнч(Параметры) = Тип("Структура") Тогда
        ВызватьИсключение "Неверный тип параметров";
    КонецЕсли;

    ДатаНачала = Параметры.ДатаНачала;
    ДатаОкончания = Параметры.ДатаОкончания;

    Если НЕ (ТипЗнч(ДатаНачала) = Тип("Дата") И ТипЗнч(ДатаОкончания) = Тип("Дата")) Тогда
        ВызватьИсключение "Параметры должны содержать даты ДатаНачала и ДатаОкончания";
    КонецЕсли;

    Результат = Новый Структура;
    Результат.Вставить("ДокументовСоздано", 0);
    Результат.Вставить("ДокументовНеСоздано", 0);
    Результат.Вставить("МассивДоговоровИРеализаций", Новый Массив);

    // 1. Получим список договоров, по которым уже есть реализации
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
        |Реализация.Договор КАК Договор
        |ИЗ
        |Документ.РеализацияТоваровУслуг КАК Реализация
        |ГДЕ
        | Реализация.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

    МассивУжеСозданныхДоговоров = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        МассивУжеСозданныхДоговоров.Добавить(Выборка.Договор);
    КонецЦикла;

    // 2. Собираем подходящие договоры
    МассивДляСоздания = Новый Массив;
    Договоры = Справочники.ДоговорыКонтрагентов.Выбрать();
    Пока Договоры.Следующий() Цикл
        Если НЕ Договоры.ЭтоГруппа И
           Договоры.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И
           НЕ ЕстьВДоговорВМассиве(МассивУжеСозданныхДоговоров, Договоры.Ссылка) Тогда

            МассивДляСоздания.Добавить(Договоры.Ссылка);
        КонецЕсли;
    КонецЦикла;

    // Создаем документы
    Для Каждого Договор Из МассивДляСоздания Цикл
        Попытка
            ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            ДокументРеализация.Дата = ДатаОкончания;
            ДокументРеализация.Договор = Договор;
            ДокументРеализация.Контрагент = Договор.Владелец;
            ДокументРеализация.Организация = Договор.Организация;

            ДокументРеализация.ВМК_ВыполнитьАвтозаполнение();
            ДокументРеализация.СуммаДокумента = ДокументРеализация.Услуги.Итог("Сумма");

            //Если НЕ ДокументРеализация.ПроверитьЗаполнение() Тогда
                //Результат.ДокументовНеСоздано = Результат.ДокументовНеСоздано + 1;
               // Продолжить;
           // КонецЕсли;

            ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
           
СтрРеализация = Новый Структура;
СтрРеализация.Вставить("Договор", Договор);
СтрРеализация.Вставить("Реализация", ДокументРеализация.Ссылка);
Результат.МассивДоговоровИРеализаций.Добавить(СтрРеализация);

            Результат.ДокументовСоздано = Результат.ДокументовСоздано + 1;

        Исключение
            Результат.ДокументовНеСоздано = Результат.ДокументовНеСоздано + 1;
        КонецПопытки;
    КонецЦикла;

    РезультатХранилища = Новый Структура;
РезультатХранилища.Вставить("ДокументовСоздано", Результат.ДокументовСоздано);
РезультатХранилища.Вставить("ДокументовНеСоздано", Результат.ДокументовНеСоздано);
РезультатХранилища.Вставить("МассивДоговоровИРеализаций", Результат.МассивДоговоровИРеализаций);




Возврат РезультатХранилища;

КонецФункции
#КонецОбласти